--
-- Copyright (c) 2022 by Ludicrous Speed, LLC
-- All rights reserved.
--
local provider={name=...,data=2,region="kr",faction=2,date="2022-03-02T06:35:15Z",currentRaid={["name"]="Sepulcher of the First Ones",["shortName"]="SFO",["bossCount"]=11},previousRaid=nil,db2={}}
local F

F = function() provider.db2["아즈샤라"]={0,"Chaosnes","Decaydragon","Deceitnes","Effic","Effis","Hunternes","Iooz","Karmin","Piratedragon","Praynes","Purenes","Rainyland","Rainylande","Rainylandi","Rainylando","Rainylands","Rainylandu","Rainylandy","Rezu","Sacrines","Satoru","Shanes","Vacantia","Yeonyy","가로쉬벌럼","가지먹고싶다","개수봉법사","개수봉악사","개수봉전사","거친두루미","거한","고양이털요정","고운말을써요","고추먹고싶다","곰탱선생님","공포의유동닉","광부인","광우부인","구두쇠","굼이","근혁","금이","금익","금잇","금잉","금히","금힛","기사슈슝","깊게박힌진동토템","꼬므캣","꼬므토끼","꼬므팬더","꼬므푸우","꼬부기린","꼬부기릿","나미","나영","납짝납짝해졌네","내이름은쯔위님","냥꾼슈슝","노움냠냠","니까","다람쥐","다람쥐볶음","다현","단칼에샤샥","달맞이밤그림자","데레비","도구차이","도비는자유애오","도시다람쥐","도줌발사","두번째풍운","두유먹고싶다","뒷다리향기","뒷발의향기","드앙","디딧치","디밋트리","딜더부인","딩가딩가성기사","딩가딩가주술사","레미","레이니냥꾼","레이니드루","레이니랜드","레이니수도","레이니악사","레이니흑마","레즈","루시안느","루키몽이귀여웡","리아브린","마나차","마무리삼격","마법사윈드러너","만나보고싶다","모찌귀여워","모찌넘귀여워","모찌엄청귀여워","모찌왕귀여워","모찌짱귀여워","모찌킹귀여워","모찌핵귀여워","모찌헐귀여워","목냥꾼","목복술","목악사","못살려못살려","미디치","바이러스","박제","방가어","법무법","법사슈슝","벙어리","병찬냥이","복페라","본죽보단혈죽","볼페라이스","북실북실볼페라","분노와절제","불맛아메리카노","비나라","비방","비전꽃꽂이","뿌엉아메리카노","살거야암살거야","삼드앙","샛끼","샛키","생석쿨","선시우","성신성","세나","세나님","세라","송혜교","수지고힐러우지윤","슈슝슝","슐이스리","스캠","신기하게보기업기","신성다람쥐","신수사랜덤박스","실바는노답이다","싫은데요","아세라냥","아세라루","아세라법","아세라성","아세라수","아세라악","아세라전","아세라주","아세라죽","아세라흑","아이레니아","아이레이나","아이레이아","아이세니아","아이센시아","아이에니아","아이에리아","안전자산적폐법사","암살도줌","앱리비아","야성다람쥐","양유리","양조분노","여보겜좀그만해요","여우선생님","예스","오드앙","오함마돈나","우유맛뮤찌","우유먹고싶다","육드앙","윤떠니개여신","응슈리","응애기사힐줘","응애사제빵줘","이고기","이괴기","이금신","이둠땅","이드앙","이매미","이복순","이안심","이주난","이휘란","이휘련","이휘류","이휘린","이휘민","이휘선","이휘수","이휘예","자연산다람쥐","잔달라깬달라","재밌다람쥐","쟌시","전경방패틀니전사","전사슈슝","정신나간채찍","제몫이아닙니다","젤리빵","젤리뽀","젤리토끼","젤리푸","조드해야지","조사부인","조커가조커서조컷","조커가조커서조컸","조커는조커서조컷","조커는조커서조컸","조커도조커서조컸","주노주농","죽기시른고블린","진짜마지막입니다","쪼꼬만애","쯔위님","쯔위님님","참리단","참치와부엉이","청산용가리","칼춤안광녀","캐쉬콜라","컨쩔어야함","키리안입니다","타락한히이라기","탐욕의아메리카노","털이복술복술해","토마토짬뽕파스타","파닥경고","파닥경보","파닭경계","파닭경고","팍퍽푹퍽","팡불바람물마음","폴라곰","폴라빛","폴라캣","폴라푸","폼떨어진스피치","피역병다람쥐","피카츄르","핑판","하은","한방의미학","핼랑","행쇼","혜지차이","혼너","홀트킹","황기둥","황천의아메리카노","히이라기신야"} end F()
F = function() provider.db2["헬스크림"]={518,"개근상","기둥이","땡김","버팀","빵딜","빵주먹","상민","샛끼","죄딘","줘팽","활딘"} end F()
F = function() provider.db2["줄진"]={540,"징기술사"} end F()
F = function() provider.db2["세나리우스"]={542,"Sig","연이","연일"} end F()
F = function() provider.db2["불타는군단"]={548,"딩가사제","딩가성기사","딩가전사","딩가주술사"} end F()

F = nil
RaiderIO.AddProvider(provider)
